AMzeo/nuttx/arch/arm/src/pic32czca90/sam_sqi.c
          rx[0] = 0xFF;
        }
      else
        {
          /* Read-command replay: TX(1:cmd) → RX(N-1).
           * Returns the last captured byte (current response position). */

          size_t rx_count = priv->pending_tx_len - 1;
          uint32_t timeout;

          g_sqi_tx_desc.bd_ctrl    = SQI_BDCTRL_DESC_EN |
                                      SQI_BDCTRL_BUFLEN(1);
          g_sqi_tx_desc.bd_stat    = 0;
          g_sqi_tx_desc.bd_bufaddr = (uint32_t)(uintptr_t)g_sqi_tx_buf;
          g_sqi_tx_desc.bd_nxtptr  = &g_sqi_rx_desc;

          g_sqi_rx_desc.bd_ctrl    = SQI_BDCTRL_DESC_EN   |
                                      SQI_BDCTRL_LAST_BD    |
                                      SQI_BDCTRL_LIFM       |
                                      SQI_BDCTRL_DIR        |
                                      SQI_BDCTRL_PKT_INT_EN |
                                      SQI_BDCTRL_BUFLEN(rx_count);
          g_sqi_rx_desc.bd_stat    = 0;
          g_sqi_rx_desc.bd_bufaddr = (uint32_t)(uintptr_t)g_sqi_rx_buf;
          g_sqi_rx_desc.bd_nxtptr  = NULL;

          sqi_putreg(SAM_SQI_INTSTAT_OFFSET, 0xFFFFFFFFu);
          sqi_putreg(SAM_SQI_BDBASEADD_OFFSET,
                     (uint32_t)(uintptr_t)&g_sqi_tx_desc);
          sqi_putreg(SAM_SQI_BDCON_OFFSET,
                     SQI_BDCON_START | SQI_BDCON_DMAEN);

          timeout = SQI_DMA_TIMEOUT;
          while (!(sqi_getreg(SAM_SQI_INTSTAT_OFFSET) & SQI_INT_PKTCOMP))
            {
              if (--timeout == 0)
                {
                  sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
                  rx[0] = 0xFF;
                  return;
                }
            }

          sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
          sqi_putreg(SAM_SQI_INTSTAT_OFFSET,
                     sqi_getreg(SAM_SQI_INTSTAT_OFFSET));

          rx[0] = g_sqi_rx_buf[rx_count - 1];
        }
    }
  else if (tx)
    {
      /* TX-only: stage bytes for later linked-chain execution.
       * Append to pending buffer (supports multi-byte commands). */

      for (i = 0; i < nwords && priv->pending_tx_len < SQI_DMA_BUF_SIZE; i++)
        {
          g_sqi_tx_buf[priv->pending_tx_len++] = tx[i];
        }
    }
  else if (rx)
    {
      /* RX requested: execute linked TX→RX chain (CS held throughout).
       * If no pending TX, just do standalone RX. */

      size_t rxlen = nwords;
      if (rxlen > SQI_DMA_BUF_SIZE)
        {
          rxlen = SQI_DMA_BUF_SIZE;
        }

      if (priv->pending_tx_len > 0)
        {
          /* Linked chain: TX BD (staged command) → RX BD (response) */

          g_sqi_tx_desc.bd_ctrl    = SQI_BDCTRL_DESC_EN |
                                      SQI_BDCTRL_BUFLEN(priv->pending_tx_len);
          g_sqi_tx_desc.bd_stat    = 0;
          g_sqi_tx_desc.bd_bufaddr = (uint32_t)(uintptr_t)g_sqi_tx_buf;
          g_sqi_tx_desc.bd_nxtptr  = &g_sqi_rx_desc;

          g_sqi_rx_desc.bd_ctrl    = SQI_BDCTRL_DESC_EN   |
                                      SQI_BDCTRL_LAST_BD    |
                                      SQI_BDCTRL_LIFM       |
                                      SQI_BDCTRL_DIR        |
                                      SQI_BDCTRL_PKT_INT_EN |
                                      SQI_BDCTRL_BUFLEN(rxlen);
          g_sqi_rx_desc.bd_stat    = 0;
          g_sqi_rx_desc.bd_bufaddr = (uint32_t)(uintptr_t)g_sqi_rx_buf;
          g_sqi_rx_desc.bd_nxtptr  = NULL;

          /* Submit and poll PKTCOMP */

          uint32_t timeout;
          sqi_putreg(SAM_SQI_INTSTAT_OFFSET, 0xFFFFFFFFu);
          sqi_putreg(SAM_SQI_BDBASEADD_OFFSET,
                     (uint32_t)(uintptr_t)&g_sqi_tx_desc);
          sqi_putreg(SAM_SQI_BDCON_OFFSET,
                     SQI_BDCON_START | SQI_BDCON_DMAEN);

          timeout = SQI_DMA_TIMEOUT;
          while (!(sqi_getreg(SAM_SQI_INTSTAT_OFFSET) & SQI_INT_PKTCOMP))
            {
              if (--timeout == 0)
                {
                  sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
                  priv->pending_tx_len = 0;
                  return;
                }
            }

          sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
          sqi_putreg(SAM_SQI_INTSTAT_OFFSET,
                     sqi_getreg(SAM_SQI_INTSTAT_OFFSET));
          priv->pending_tx_len = 0;

          for (i = 0; i < rxlen; i++)
            {
              rx[i] = g_sqi_rx_buf[i];
            }
        }
      else
        {
          /* No pending TX — standalone RX BD (e.g. bulk read after cmd) */

          g_sqi_rx_desc.bd_ctrl    = SQI_BDCTRL_DESC_EN   |
                                      SQI_BDCTRL_LAST_BD    |
                                      SQI_BDCTRL_CBD_INT_EN |
                                      SQI_BDCTRL_DIR        |
                                      SQI_BDCTRL_BUFLEN(rxlen);
          g_sqi_rx_desc.bd_stat    = 0;
          g_sqi_rx_desc.bd_bufaddr = (uint32_t)(uintptr_t)g_sqi_rx_buf;
          g_sqi_rx_desc.bd_nxtptr  = NULL;

          if (sqi_dma_run(&g_sqi_rx_desc, rxlen, 0) < 0)
            {
              return;
            }

          for (i = 0; i < rxlen; i++)
            {
              rx[i] = g_sqi_rx_buf[i];
            }
        }
    }
}

static uint32_t sqi_send(FAR struct spi_dev_s *dev, uint32_t wd)
{
  uint8_t tx = (uint8_t)wd;
  uint8_t rx = 0;
  sqi_exchange(dev, &tx, &rx, 1);
  return rx;
}

/****************************************************************************
 * Public Function: sam_sqi_flash_cmd_read
 *
 * Submit a linked TX BD → RX BD chain in a single DMA operation so CS
 * stays asserted across command and response phases.
 *
 * TX BD: no CBD_INT_EN, no LAST_BD, bd_nxtptr → g_sqi_rx_desc.
 * RX BD: CBD_INT_EN + LAST_BD + LIFM.
 *
 * Polls PKTCOMP (fires at LIFM = end of SPI transaction), NOT BDDONE.
 * BDDONE may fire per-BD regardless of CBD_INT_EN (hardware-dependent);
 * PKTCOMP only fires once at the LIFM-marked BD — safe for multi-BD chains.
 ****************************************************************************/

int sam_sqi_flash_cmd_read(FAR struct spi_dev_s *dev,
                            FAR const uint8_t *cmd, size_t cmdlen,
                            FAR uint8_t *data, size_t datalen)
{
  uint32_t timeout;
  uint32_t intstat;
  size_t   i;

  if (cmdlen == 0 || cmdlen > SQI_DMA_BUF_SIZE ||
      datalen == 0 || datalen > SQI_DMA_BUF_SIZE)
    {
      return -EINVAL;
    }

