AMzeo/nuttx/arch/arm/src/pic32czca90/sam_sqi.c
  /* SWRST + full reinit — clears BD processor cache (Michigan Ax) */

  sqi_full_reset();

  for (i = 0; i < cmdlen; i++)
    {
      g_sqi_tx_buf[i] = cmd[i];
    }

  /* Flush D-Cache for TX buffer + descriptors (no MPU nocache region yet) */

  {
    uintptr_t addr;
    for (addr = (uintptr_t)g_sqi_tx_buf & ~31u;
         addr < (uintptr_t)g_sqi_tx_buf + SQI_DMA_BUF_SIZE;
         addr += 32)
      putreg32(addr, 0xE000EF68u);  /* DCCMVAC */
    for (addr = (uintptr_t)&g_sqi_tx_desc & ~31u;
         addr < (uintptr_t)&g_sqi_tx_desc + 32;
         addr += 32)
      putreg32(addr, 0xE000EF68u);
    for (addr = (uintptr_t)&g_sqi_rx_desc & ~31u;
         addr < (uintptr_t)&g_sqi_rx_desc + 32;
         addr += 32)
      putreg32(addr, 0xE000EF68u);
    __asm__ volatile ("dsb sy" ::: "memory");
  }

  /* TX BD — chains to RX BD */

  g_sqi_tx_desc.bd_ctrl    = SQI_BDCTRL_DESC_EN   |
                              SQI_BDCTRL_BUFLEN(cmdlen);
  g_sqi_tx_desc.bd_stat    = 0;
  g_sqi_tx_desc.bd_bufaddr = (uint32_t)(uintptr_t)g_sqi_tx_buf;
  g_sqi_tx_desc.bd_nxtptr  = &g_sqi_rx_desc;

  /* RX BD — CBD_INT_EN + LAST_BD + LIFM */

  /* PKT_INT_EN triggers PKTCOMP in INTSTAT when this LIFM BD completes.
   * On Michigan Ax, BDCON.DMAEN does not auto-clear — PKTCOMP is the only
   * reliable completion signal for linked BD chains. */

  g_sqi_rx_desc.bd_ctrl    = SQI_BDCTRL_DESC_EN   |
                              SQI_BDCTRL_LAST_BD    |
                              SQI_BDCTRL_LIFM       |
                              SQI_BDCTRL_DIR        |
                              SQI_BDCTRL_PKT_INT_EN |
                              SQI_BDCTRL_BUFLEN(datalen);
  g_sqi_rx_desc.bd_stat    = 0;
  g_sqi_rx_desc.bd_bufaddr = (uint32_t)(uintptr_t)g_sqi_rx_buf;
  g_sqi_rx_desc.bd_nxtptr  = NULL;


  /* Force CS HIGH between commands (t_CSH >= 50 ns for SST26) */

  {
    uint32_t c = sqi_getreg(SAM_SQI_CFG_OFFSET);
    volatile int _dly;
    sqi_putreg(SAM_SQI_CFG_OFFSET, c & ~SQI_CFG_SQIEN);
    for (_dly = 0; _dly < 50; _dly++) { __asm__ volatile ("nop"); }
    sqi_putreg(SAM_SQI_CFG_OFFSET, c);
  }

  /* Drain stale RXFIFO bytes */

  while (sqi_getreg(SAM_SQI_STAT1_OFFSET) & SQI_STAT1_RXBUFCNT_MASK)
    {
      (void)sqi_getreg(SAM_SQI_RXDATA_OFFSET);
    }

  sqi_putreg(SAM_SQI_INTSTAT_OFFSET, 0xFFFFFFFFu);
  sqi_modreg(SAM_SQI_CFG_OFFSET, 0, SQI_CFG_RXBUFRST);
  sqi_putreg(SAM_SQI_BDBASEADD_OFFSET, (uint32_t)(uintptr_t)&g_sqi_tx_desc);
  sqi_putreg(SAM_SQI_BDCON_OFFSET, SQI_BDCON_START | SQI_BDCON_DMAEN);

  timeout = SQI_DMA_TIMEOUT;
  while (!(sqi_getreg(SAM_SQI_INTSTAT_OFFSET) & SQI_INT_PKTCOMP))
    {
      if (--timeout == 0)
        {
          intstat = sqi_getreg(SAM_SQI_INTSTAT_OFFSET);
          syslog(LOG_ERR,
                 "[sqi] cmd_read timeout INTSTAT=%08lx BDSTAT=%08lx"
                 " BDRXDSTAT=%08lx BDTXDSTAT=%08lx\n"
                 "[sqi]   BDCON=%08lx BDCURADD=%08lx STAT1=%08lx STAT2=%08lx\n"
                 "[sqi]   tx_bd_ctrl=%08lx rx_bd_ctrl=%08lx"
                 " rxbuf=%02x %02x %02x\n",
                 (unsigned long)intstat,
                 (unsigned long)sqi_getreg(SAM_SQI_BDSTAT_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_BDRXDSTAT_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_BDTXDSTAT_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_BDCON_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_BDCURADD_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_STAT1_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_STAT2_OFFSET),
                 (unsigned long)g_sqi_tx_desc.bd_ctrl,
                 (unsigned long)g_sqi_rx_desc.bd_ctrl,
                 (unsigned)g_sqi_rx_buf[0],
                 (unsigned)g_sqi_rx_buf[1],
                 (unsigned)g_sqi_rx_buf[2]);
          sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
          return -EIO;
        }
    }

  sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
  sqi_putreg(SAM_SQI_INTSTAT_OFFSET, sqi_getreg(SAM_SQI_INTSTAT_OFFSET));

  /* Invalidate D-Cache for RX buffer (no MPU nocache region yet) */

  {
    uintptr_t addr;
    for (addr = (uintptr_t)g_sqi_rx_buf & ~31u;
         addr < (uintptr_t)g_sqi_rx_buf + datalen;
         addr += 32)
      putreg32(addr, 0xE000EF5Cu);  /* DCIMVAC */
    __asm__ volatile ("dsb sy" ::: "memory");
  }

  for (i = 0; i < datalen; i++)
    {
      data[i] = g_sqi_rx_buf[i];
    }

  return 0;
}

/****************************************************************************
 * Public Function: sam_sqibus_initialize
 *
 * Init sequence mirrors Harmony plib_sqi1.c SQI1_Initialize():
 *   GCLK/MCLK → pins → SWRST → CFG(DMA,BURSTEN,DATAEN=0,CSEN0) →
 *   CLKCON(EN→STABLE→CLKDIV) → SQIEN → CMDTHR(32,32) → INTTHR(1,1) →
 *   THR(1) → INTEN(PKTCOMP|BDDONE) → INTSIGEN(same) → BDCON=0
 *
 * CFG value: MODE=DMA(2), BURSTEN(bit11), DATAEN=0(single-lane SPI), CSEN0.
 * NOT DATAEN=2 (quad) — SST26 starts in SPI mode; quad needs QPIEN first.
 ****************************************************************************/

FAR struct spi_dev_s *sam_sqibus_initialize(int bus)
{
  struct sam_sqi_dev_s *priv = &g_sqi1_dev;

  if (bus != 1)
    {
      return NULL;
    }


  /* 1. Mux SQI1 pins — IO2/IO3 PULLEN+OUTVAL_HIGH keeps WP#/HOLD# high */

  sam_portconfig(PORT_SQI1_CLK);
  sam_portconfig(PORT_SQI1_CS0);
  sam_portconfig(PORT_SQI1_IO0);
  sam_portconfig(PORT_SQI1_IO1);
  sam_portconfig(PORT_SQI1_IO2);
  sam_portconfig(PORT_SQI1_IO3);

  /* Read back PORT registers to confirm PMUXEN=1 and func=7 (FUNC_H) on
   * every SQI1 pin.  Expected:
   *   PORTG PINCFG[0]=03 PINCFG[3]=03 PMUX[0]=77 PMUX[1]=77
   *   PORTC PINCFG[30]=01 PINCFG[31]=03 PMUX[15]=77
   * PMUXEN=bit0 of PINCFG; PMUX nibble=7 means FUNC_H=SQI1.
   * If any PINCFG shows bit0=0, that pin is still GPIO (not muxed). */



  /* 2. Enable GCLK2 → SQI1 (GCLK_PCHCTRL[57]) */

  sam_gclk_chan_enable(SAM_SQI1_GCLK_ID, SQI1_GCLK_GEN, false);

  /* 3. Enable MCLK AHB clock for SQI1 */

  sqi_mclk_enable();

