AMzeo/nuttx/arch/arm/src/pic32czca90/sam_sqi.c
  sqi_putreg(SAM_SQI_INTSTAT_OFFSET, 0xFFFFFFFFu);
  sqi_putreg(SAM_SQI_BDBASEADD_OFFSET, (uint32_t)(uintptr_t)&g_sqi_tx_desc);
  sqi_putreg(SAM_SQI_BDCON_OFFSET, SQI_BDCON_START | SQI_BDCON_DMAEN);

  timeout = SQI_DMA_TIMEOUT;
  while (!(sqi_getreg(SAM_SQI_INTSTAT_OFFSET) &
           (SQI_INT_BDDONE | SQI_INT_PKTCOMP)))
    {
      if (--timeout == 0)
        {
          sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
          return -EIO;
        }
    }

  sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
  sqi_putreg(SAM_SQI_INTSTAT_OFFSET, sqi_getreg(SAM_SQI_INTSTAT_OFFSET));
  return 0;
}

static void sqi_full_reset(void)
{
  putreg8(SQI_CTRLA_SWRST, SAM_SQI1_CTRLA);
  while (getreg8(SAM_SQI1_SYNCBUSY) & SQI_SYNCBUSY_SWRST)
    ;

  /* Clear XIP registers — they persist through SWRST and can interfere
   * with DMA mode if sam_sqi_enter_xip() was previously called. */

  sqi_putreg(SAM_SQI_XCON1_OFFSET, 0);
  sqi_putreg(SAM_SQI_XCON2_OFFSET, 0);

  /* RXBUFRST + configure DMA mode */

  sqi_putreg(SAM_SQI_CFG_OFFSET,
             SQI_CFG_MODE_DMA | SQI_CFG_BURSTEN |
             SQI_CFG_DATAEN(0) | SQI_CFG_CSEN0 | SQI_CFG_RXBUFRST);
  sqi_putreg(SAM_SQI_CLKCON_OFFSET, SQI_CLKCON_EN);
  while (!(sqi_getreg(SAM_SQI_CLKCON_OFFSET) & SQI_CLKCON_STABLE))
    ;
  sqi_putreg(SAM_SQI_CLKCON_OFFSET,
             SQI_CLKCON_EN | SQI_CLKCON_CLKDIV(SQI1_CLKDIV_50MHZ));
  while (!(sqi_getreg(SAM_SQI_CLKCON_OFFSET) & SQI_CLKCON_STABLE))
    ;
  sqi_modreg(SAM_SQI_CFG_OFFSET, 0, SQI_CFG_SQIEN);
  sqi_putreg(SAM_SQI_CMDTHR_OFFSET,
             SQI_CMDTHR_RXCMDTHR(0x01u) | SQI_CMDTHR_TXCMDTHR(0x01u));
  sqi_putreg(SAM_SQI_INTTHR_OFFSET,
             SQI_INTTHR_RXINTTHR(0x01u) | SQI_INTTHR_TXINTTHR(0x01u));
  sqi_putreg(SAM_SQI_THR_OFFSET, SQI_THR_THRES(1u));
  sqi_putreg(SAM_SQI_INTEN_OFFSET,
             SQI_INTEN_BDDONEIE | SQI_INTEN_PKTCOMPIE);
  sqi_putreg(SAM_SQI_INTSIGEN_OFFSET,
             SQI_INTSIGEN_BDDONEISE | SQI_INTSIGEN_PKTCOMPISE);
  sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
  sqi_putreg(SAM_SQI_INTSTAT_OFFSET, 0xFFFFFFFFu);
}

/****************************************************************************
 * Public Function: sam_sqi_flash_wren_cmd
 *
 * Send WREN (0x06) followed by a command, with ONE SWRST at the start.
 * NO SWRST between WREN and the command — preserves WEL.
 * Uses Harmony pattern: RXBUFRST + BDBASEADD + START per BD submission.
 * Returns 0 on success, -EIO on timeout.
 ****************************************************************************/

int sam_sqi_flash_wren_cmd(FAR const uint8_t *cmd, size_t cmdlen)
{
  int ret;
  uint8_t wren = 0x06u;

  ret = sam_sqi_flash_cmd_write(&wren, 1);
  if (ret < 0) return ret;

  /* RDSR between WREN and the write command is REQUIRED.
   * The cmd_read (TX→RX linked chain) resets BD processor state so the
   * subsequent standalone TX BD produces bus activity. Without this,
   * SE/PP commands silently fail (confirmed by logic analyzer). */

  sam_sqi_flash_rdsr();

  return sam_sqi_flash_cmd_write(cmd, cmdlen);
}

/****************************************************************************
 * Public Function: sam_sqi_flash_rdsr
 *
 * Read the SST26 Status Register via TX(1:0x05)→RX(1) linked chain.
 * Returns the status byte, or -1 on timeout.
 ****************************************************************************/

int sam_sqi_flash_rdsr(void)
{
  uint8_t cmd = 0x05u;
  uint8_t status;
  int ret;

  ret = sam_sqi_flash_cmd_read(NULL, &cmd, 1, &status, 1);

  return (ret < 0) ? -1 : (int)status;
}

#endif /* CONFIG_PIC32CZCA90_SQI1 */
